In [2]:
phrase = "I'm Paul" # string
print(phrase)

I'm Paul

In [5]:
x = 5 #integer
y = 10 
z = x + y
z = y/x 
print(z)

print(type(z))

2.0
<class 'float'>

In [6]:
x = 12
y = 10
z = x*y
print (z)

120

In [11]:
radius = 2
pie = 3.14
area = pie * (radius**2)
print (area)

12.56

In [20]:
name = " Paul"
hobby =" Mario"
long_string = "my name is" + name + " and my hobby is" + hobby
#print (long_string)

phrase = f"My name is {name} and my hobby is {hobby}"
print(phrase)

My name is  Paul and my hobby is  Mario

In [21]:
name1 = "Paul Dryden"
jobtitle ="senior P&D Manager"
phrase1 = f"my name is {name1} and my role is {jobtitle}"
print (phrase1)

my name is Paul Dryden and my role is senior P&D Manager

In [26]:
#print(len(phrase1))

string_slice = phrase[3:16]
#print (string_slice)

filename = "here_is_a_file.csv"
filename = filename[:-4]
print (filename)

here_is_a_file

In [31]:
slice_this_phrase = 'dog cat racoon'
word1 = slice_this_phrase [:4]
word2 = slice_this_phrase [4:8]
word3 = slice_this_phrase [-7:]
print (f"{word1} {word2}")

dog  cat

In [32]:
list_1 = [1,2,3, x, y]
print (list_1)

[1, 2, 3, 12, 10]

In [37]:
favourite_colour = "orange"
colours_list = ['red', 'blue', 'green']
colours_list.append(favourite_colour)



print (f'my colours are {colours_list}')

my colours are ['red', 'blue', 'green', 'orange']

In [6]:
foods_list =['lasagne' ' fajita' ' pizza']
foods_list.append ("chips")
print (foods_list)

['lasagne fajita pizza', 'chips']

In [19]:
foods_list =['lasagne' ' fajita' ' pizza']
foods_list2 =['chicken', 'spaghetti']
foods_list.extend (foods_list2)
foods_list.remove ('chicken')
print (foods_list)

['lasagne fajita pizza', 'spaghetti']

In [24]:
numbers_list = [ 2, 3, 4, 5, 1, 6]
numbers_list.sort()
print (numbers_list)
numbers_list.sort(reverse=True)
print (numbers_list)

numbers_list = [ 2, 3, 4, 5, 1, 6]
sorted_numbers = sorted(numbers_list)
print(sorted_numbers)

[1, 2, 3, 4, 5, 6]
[6, 5, 4, 3, 2, 1]
[1, 2, 3, 4, 5, 6]

In [29]:
sorted_food = sorted (foods_list)
print (sorted_food)

['lasagne fajita pizza', 'spaghetti']

In [33]:
favourite_colours_dict = {'will':'purple', 
                     'scout':['yellow', 'red'],
                     'crash' :23,
                     'Naomi' : {'Monday' : 'Purple',
                                'EOD' : 'Yellow'}}

print (favourite_colours_dict)

{'will': 'purple', 'scout': ['yellow', 'red'], 'crash': 23, 'Naomi': {'Monday': 'Purple', 'EOD': 'Yellow'}}

In [38]:
restaurants_dict = {'Wagamama':'katsu',
                    'Nandos' :['chicken', 'haloumi']}
print(restaurants_dict['Wagamama'])

katsu

In [41]:
restaurants_dict = {'Wagamama':'katsu',
                    'Nandos' :['chicken', 'haloumi']}

restaurants_dict['TGI'] = 'Burger'
print(restaurants_dict)

print('Wagamama' in restaurants_dict)

{'Wagamama': 'katsu', 'Nandos': ['chicken', 'haloumi'], 'TGI': 'Burger'}
True

In [61]:
team_dict = {'Paul1' : 'Snr P&D Manager',
            'Martin' : 'SQL Developer',
             'Paul2' : 'Project Performance Officer' }

names = list (team_dict.keys())
names_sorted = sorted(names)
for key , val in team_dict.items():
    print (f"My name is  {key}, my job is {val}.")

My name is  Paul1, my job is Snr P&D Manager.
My name is  Martin, my job is SQL Developer.
My name is  Paul2, my job is Project Performance Officer.

In [22]:
#HOMEWORK_1
homework_dict = {}
 
x = 7
y = 5
 
add = x+y
multiply = x*y
xsquare = x**2
ysquare = y**2
xpowery = x**y
 
homework_dict["x + y"] = add
homework_dict["x * y"] = multiply,
homework_dict["x^2"] = xsquare,
homework_dict["y^2"] = ysquare,
homework_dict["x^y"]= xpowery
 
for homeworklist in homework_dict.items():
  print(homeworklist)

('x + y', 12)
('x * y', (35,))
('x^2', (49,))
('y^2', (25,))
('x^y', 16807)

In [ ]:
CCnumber = "4444444444444444"
CClast4 = CCnumber [:-4]
print (CClast4)

In [4]:
CCnumber = "4444444444441111"
CClast4 = CCnumber [12:16]
CCXX = "XXXXXXXXXXXX"
CCXX2 = CCXX+CClast4
phrase = f"{CCXX}{CClast4}"
print (phrase)

XXXXXXXXXXXX1111

In [2]:
import pandas as pd

dict_1 = {"here's a column":['val 1', 'val2', 'val3'],
          "col 2": [4,5,6],
          "col z": ['foo', 'bar', 'baz']}

df_1 = pd.DataFrame(dict_1)
df_1

  here's a column  col 2 col z
0           val 1      4   foo
1            val2      5   bar
2            val3      6   baz

In [7]:
list_of_dicts = [{'letter': 'A',
                  'Word' : 'foo',
                  'number' : 1},
                  {'letter': 'B',
                  'Word' : 'baz',
                  'number' : 2}]

df_2 = pd.DataFrame(list_of_dicts)
df_2

  letter Word  number
0      A  foo       1
1      B  baz       2

In [21]:
jobs_table = [{'Employee': 'Jon Maggs',
                  'Title' : 'Coach Beard',
                  'salary' : 50000,
                  'DOB' : '05/03/85'},
                  {'Employee': 'Michael Mac',
                  'Title' : 'Chief of Hair',
                  'salary' : 50000,
                  'DOB' : '12/06/89'},
                  {'Employee': 'Emily Dickson',
                  'Title' : 'Numbers Whizz',
                  'salary' : 50000,
                  'DOB' : '09/02/92'},
                  {'Employee': 'Paul Dryden',
                  'Title' : 'The Boss',
                  'salary' : 1000000,
                  'DOB' : '09/02/92'}]

jobs_df = pd.DataFrame (jobs_table)
jobs_df

        Employee          Title   salary       DOB
0      Jon Maggs    Coach Beard    50000  05/03/85
1    Michael Mac  Chief of Hair    50000  12/06/89
2  Emily Dickson  Numbers Whizz    50000  09/02/92
3    Paul Dryden       The Boss  1000000  09/02/92

In [13]:
#print(jobs_df.info())
# print(jobs_df.dtypes)
# print(jobs_df.head(1))
# print(jobs_df.tail(1))

In [17]:
# jobs_df['salary'] = jobs_df['salary'].astype('str')
# DOES NOT work print (jobs_df)['Salary'].sum)

SyntaxError: unmatched ')' (1995957910.py, line 2)

In [18]:
inflation = 1.067
jobs_df['salary'] = jobs_df['salary'] * inflation
jobs_df

        Employee          Title     salary
0      Jon Maggs    Coach Beard    53350.0
1    Michael Mac  Chief of Hair    53350.0
2  Emily Dickson  Numbers Whizz    53350.0
3    Paul Dryden       The Boss  1067000.0

In [25]:
jobs_df['DOB'] = pd.to_datetime(jobs_df['DOB'], format='%d/%m/%y')
jobs_df

        Employee          Title   salary        DOB
0      Jon Maggs    Coach Beard    50000 1985-03-05
1    Michael Mac  Chief of Hair    50000 1989-06-12
2  Emily Dickson  Numbers Whizz    50000 1992-02-09
3    Paul Dryden       The Boss  1000000 1992-02-09

In [5]:
restaurantsDF = [{'starter': 'garlic bread',
                  'main' : 'spaghetti',
                  'dessert' : 'ice cream'},
                  {'starter': 'calamari',
                  'main' : 'pizza',
                  'dessert' : 'tiramisu'}]

restaurantsDF = pd.DataFrame(restaurantsDF)
restaurantsDF

        starter       main    dessert
0  garlic bread  spaghetti  ice cream
1      calamari      pizza   tiramisu